Revit 2024 API
DoubleClickOptions.GetAction Method
 Returns the active user's desired action for a particular double-click target.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public DoubleClickAction GetAction(
	DoubleClickTarget target
)
Visual Basic
Public Function GetAction ( _
	target As DoubleClickTarget _
) As DoubleClickAction
Visual C++
public:
DoubleClickAction GetAction(
	DoubleClickTarget target
)
Parameters
target
Type: Autodesk.Revit.UI.DoubleClickTarget
 The target to check.
Return Value
 The user's desired action for the specified target.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace